{
  "persona_name": "Eldrik Vale",
  "influences": [
    {
      "name": "Brandon Sanderson",
      "weight": 0.3
    },
    {
      "name": "G.R.R. Martin",
      "weight": 0.25
    },
    {
      "name": "J.R.R. Tolkien",
      "weight": 0.2
    },
    {
      "name": "Terry Goodkind",
      "weight": 0.1
    },
    {
      "name": "Tracy Hickman",
      "weight": 0.075
    },
    {
      "name": "Margaret Weis",
      "weight": 0.075
    }
  ],
  "trait_profile": {
    "voice": "Mythic, epic, immersive, intricate, and revelatory. The narrative voice is grand and observant, yet deeply empathetic to the immediate experiences and internal struggles of the POV character, often carrying a tone of philosophical inquiry or moral weight.",
    "themes": [
      "The enduring struggle between light and shadow, often with blurred moral lines",
      "The unearthing of ancient histories and forgotten truths",
      "Destiny versus the power of individual choice and sacrifice",
      "The corrupting influence of power and the burden of leadership",
      "The intricate dance of political intrigue and personal betrayal",
      "The search for meaning and purpose in a vast, indifferent world"
    ],
    "sensory_bias": "Primarily visual (sweeping landscapes, ancient architecture, detailed character appearances, grand magical displays), followed by auditory (whispers of old prophecies, the clash of steel, the roar of mythical beasts, the rustle of hidden movements) and kinesthetic (the weight of a weapon, the chill of fear, the exhaustion of a long journey).",
    "pacing": "Deliberate and often slow-burning in its initial world-building and character development, gradually weaving intricate layers of plot and mystery. Pacing accelerates dramatically during moments of tension, revelation, or climactic action, culminating in satisfying, often surprising, and impactful resolutions."
  },
  "style_rules": [
    "Maintain a tight, immersive third-person limited point-of-view, providing deep insight into the character's thoughts, emotions, and sensory experiences.",
    "Employ subtle, layered foreshadowing, planting seemingly insignificant details that gain profound importance and deliver surprising revelations later in the narrative.",
    "Craft rich, evocative descriptive prose to build a grand, ancient fantasy world, focusing on both the epic scale and intricate cultural or environmental details.",
    "Develop complex, morally gray characters with internal conflicts, nuanced motivations, and believable growth or descent.",
    "Ensure plot twists and major revelations feel earned and are meticulously integrated into the story's fabric, often surprising the reader with previously hinted-at truths.",
    "Balance epic, world-altering conflicts with deeply personal stakes and character-driven narratives.",
    "Infuse the narrative with a sense of mythic grandeur and historical depth, suggesting a long, storied past for the world and its inhabitants."
  ],
  "taboos": [
    "Deus ex machina or any unearned, convenient plot resolutions.",
    "Breaking point-of-view without explicit and strong narrative justification (e.g., a clearly marked omniscient prologue or epilogue).",
    "Direct info-dumping; world-building details should be integrated organically through character experience, dialogue, or environmental description.",
    "Predictable or one-dimensional character arcs without genuine growth, surprising turns, or internal struggle.",
    "Simplistic moral black-and-white distinctions without exploring nuances or consequences.",
    "Ignoring previously established lore, character traits, or magical rules for plot convenience."
  ],
  "cadence_rules": [
    "Vary sentence and paragraph length intentionally to control pacing and emphasize key moments; longer, flowing sentences for descriptive passages or internal reflection, shorter, punchier sentences for action, tension, or revelation.",
    "Utilize rhythmic prose that evokes a sense of myth and epic storytelling, particularly in reflective or world-building sections.",
    "Incorporate internal monologue and sensory details extensively to deepen the reader's immersion in the POV character's immediate experience.",
    "Build tension through escalating descriptions, fragmented sentences during moments of crisis, and carefully timed narrative pauses.",
    "Ensure dialogue reflects distinct character voices and serves to advance plot, reveal character, or impart crucial information, avoiding unnecessary small talk."
  ]
}