{
  "chapter_id": 3,
  "title": "The Fading Light",
  "goal": "Eldrin attempts to use his magic, they encounter a village directly affected by the blight, and they decide on a concrete path forward.",
  "chapter_role": "pressure",
  "stakes_shift": "Eldrin accepts a nascent responsibility to investigate this new darkness, however limited his current power, recognizing the blight's immediate threat.",
  "bridge": {
    "from_prev": "Eldrin and Lyra have witnessed the blight's physical effects.",
    "to_next": "Their journey begins in earnest, through lands increasingly touched by corruption."
  },
  "pacing": {
    "intensity": 4,
    "tempo": "steady",
    "expected_scene_count": 10
  },
  "sections": [
    {
      "section_id": 1,
      "title": "Stirrings of Power",
      "intent": "Show Eldrin's first conscious attempt at magic, highlighting his weakened state but also his potential.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "Eldrin attempts a simple spell to cleanse a blighted plant, struggling to command the ancient energies, but achieving a partial success.",
          "type": "action",
          "outcome": "Eldrin demonstrates a fraction of his magical ability, confirming his identity to Lyra and his own potential.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra"
          ],
          "threads": [
            "THREAD_Rediscovering_Magic"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "A Village's Despair",
      "intent": "Illustrate the human cost of the blight, showing its psychological and social impact.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "They arrive at a small, isolated village where the inhabitants are listless, paranoid, and subtly corrupted by the blight's influence.",
          "type": "reveal",
          "outcome": "The village is found to be suffering from the blight's insidious psychological effects, not just physical decay.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra"
          ],
          "threads": [
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "The Sage's Resolve",
      "intent": "Eldrin makes a conscious decision to act, driven by the suffering he witnesses.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "Witnessing the villagers' despair solidifies Eldrin's resolve; he cannot ignore this new darkness, despite his diminished power.",
          "type": "choice",
          "outcome": "Eldrin accepts his role in confronting the blight, committing to seek knowledge and solutions.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra"
          ],
          "threads": [
            "THREAD_Awakened_Sage",
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 4,
      "title": "A Path to Knowledge",
      "intent": "Establish their immediate goal: to find a source of information or a sage who might understand the blight.",
      "scenes": [
        {
          "scene_id": 4,
          "summary": "Lyra suggests seeking out the scholars of the Free Cities, or perhaps a reclusive sage rumored to dwell in the northern mountains.",
          "type": "setup",
          "outcome": "Eldrin and Lyra decide to journey towards a known center of learning or a rumored sage to find answers.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra"
          ],
          "threads": [
            "THREAD_Gathering_Allies"
          ]
        }
      ]
    }
  ]
}