{
  "chapter_id": 20,
  "title": "Clash of Wills",
  "goal": "Eldrin directly confronts and defeats Valerius in a climactic magical and physical battle, ending his immediate threat.",
  "chapter_role": "confrontation",
  "stakes_shift": "The outcome of this battle determines the immediate future of the resistance and the city, with Valerius's defeat offering a fragile hope.",
  "bridge": {
    "from_prev": "The group is engaged in a desperate battle against Valerius and his forces.",
    "to_next": "The immediate aftermath of the battle, revealing the cost of victory and the lingering blight."
  },
  "pacing": {
    "intensity": 5,
    "tempo": "rush",
    "expected_scene_count": 8
  },
  "sections": [
    {
      "section_id": 1,
      "title": "The Sage vs. The Corrupted Lord",
      "intent": "Eldrin engages Valerius in a direct, high-stakes magical duel.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "Eldrin unleashes the full force of his rediscovered magic, engaging Valerius in a devastating duel of ancient light against encroaching shadow.",
          "type": "action",
          "outcome": "Eldrin engages Valerius in a climactic magical battle, pushing his powers to their limits.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Valerius"
          ],
          "threads": [
            "THREAD_Rediscovering_Magic",
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "Sacrifice and Support",
      "intent": "The allies create openings or protect Eldrin, showcasing their loyalty and skills.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "Lyra and Kael bravely hold off corrupted guards, creating crucial openings for Eldrin, while Seraphina shields them with protective wards.",
          "type": "action",
          "outcome": "The allies provide crucial support, allowing Eldrin to focus his power on Valerius.",
          "characters": [
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina",
            "CHAR_Eldrin"
          ],
          "threads": [
            "THREAD_Gathering_Allies"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "Valerius's Fall",
      "intent": "Eldrin delivers the final blow, defeating Valerius and ending his reign of terror.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "With a final, desperate surge of power, Eldrin overwhelms Valerius, banishing the blight from his form and bringing his reign of terror to an end.",
          "type": "climax",
          "outcome": "Eldrin defeats Valerius, ending his immediate threat to the city.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Valerius"
          ],
          "threads": [
            "THREAD_Valerius_Deception",
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    }
  ]
}