{
  "chapter_id": 17,
  "title": "Flight and Pursuit",
  "goal": "The group is forced to adapt and escape Valerius's immediate, violent retaliation, showcasing their combined combat and evasion skills.",
  "chapter_role": "action",
  "stakes_shift": "Their plan goes awry, forcing them into a desperate flight for survival against overwhelming odds, threatening to scatter the alliance.",
  "bridge": {
    "from_prev": "The public confrontation with Valerius has erupted into chaos.",
    "to_next": "The group discovers the true, hidden source of the blight within the city, revealing Valerius's deeper, more sinister plan."
  },
  "pacing": {
    "intensity": 5,
    "tempo": "rush",
    "expected_scene_count": 10
  },
  "sections": [
    {
      "section_id": 1,
      "title": "Desperate Escape",
      "intent": "The group fights their way out of the immediate danger, relying on their individual strengths.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "Eldrin unleashes ancient magic, Kael cuts a path, and Lyra guides them through the panicked crowds, fending off Valerius's guards.",
          "type": "action",
          "outcome": "The group successfully fights their way out of the immediate danger, escaping the city square.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Gathering_Allies",
            "THREAD_Rediscovering_Magic"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "Through the Labyrinth",
      "intent": "The pursuit continues through the city, testing their evasion skills and cooperation.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "They navigate the city's back alleys and rooftops, with Valerius's relentless forces hot on their heels, using every trick to evade capture.",
          "type": "action",
          "outcome": "The group successfully evades Valerius's relentless pursuit through the city, but remains trapped within its walls.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Valerius_Deception"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "A Hidden Path",
      "intent": "Seraphina reveals a secret escape route or hiding place known only to scholars.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "Seraphina remembers a forgotten network of tunnels beneath the city, traditionally used by scholars for clandestine meetings.",
          "type": "reveal",
          "outcome": "Seraphina leads the group to a secret network of tunnels beneath the city, offering a temporary reprieve.",
          "characters": [
            "CHAR_Seraphina",
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael"
          ],
          "threads": [
            "THREAD_Gathering_Allies"
          ]
        }
      ]
    }
  ]
}