{
  "chapter_id": 21,
  "title": "The Cost of Victory",
  "goal": "Show the immediate aftermath of the battle, the physical and emotional cost of victory, and the lingering presence of the blight's influence.",
  "chapter_role": "aftermath",
  "stakes_shift": "Victory is achieved, but at a significant cost, and the larger threat of the Shadow Blight remains, reminding them this was only a skirmish.",
  "bridge": {
    "from_prev": "Valerius has been defeated, the immediate battle concluded.",
    "to_next": "The heroes must now address the humanitarian and political consequences of their actions, beginning the process of healing."
  },
  "pacing": {
    "intensity": 3,
    "tempo": "slow_burn",
    "expected_scene_count": 9
  },
  "sections": [
    {
      "section_id": 1,
      "title": "Silence and Smoke",
      "intent": "Depict the immediate, quiet aftermath of the battle, the destruction and exhaustion.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "The chamber falls silent, filled with smoke and the lingering scent of corruption, the group exhausted but alive amidst the devastation.",
          "type": "aftermath",
          "outcome": "The immediate battle ends, leaving the group exhausted and the chamber devastated.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "Lingering Taint",
      "intent": "Show that while Valerius is gone, the blight's influence is still present and requires attention.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "Though Valerius is defeated, the chamber still pulses with residual blight energy, hinting at the pervasive nature of the darkness.",
          "type": "consequence",
          "outcome": "The blight's influence lingers, proving its deeper roots than just Valerius.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "The Price Paid",
      "intent": "Show the physical and emotional toll on the characters, and potential casualties.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "The group tends to their wounds, both physical and emotional, acknowledging the sacrifices made and the heavy cost of their victory.",
          "type": "aftermath",
          "outcome": "The group suffers injuries and emotional toll, recognizing the high cost of their victory.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Gathering_Allies"
          ]
        }
      ]
    }
  ]
}