{
  "chapter_id": 7,
  "title": "The Corrupted Spring",
  "goal": "Investigate a specific, localized source of corruption, forcing Eldrin to push his magical limits and revealing more about the blight's nature.",
  "chapter_role": "pressure",
  "stakes_shift": "Direct confrontation with a potent manifestation of the blight forces Eldrin to push his magical limits, risking his fragile recovery and revealing the blight's destructive capabilities.",
  "bridge": {
    "from_prev": "The group has a shared understanding of the blight's pervasive nature.",
    "to_next": "The journey continues towards a frontier town, where the blight's social impact becomes evident."
  },
  "pacing": {
    "intensity": 5,
    "tempo": "steady",
    "expected_scene_count": 10
  },
  "sections": [
    {
      "section_id": 1,
      "title": "A Poisoned Wellspring",
      "intent": "Locate a prominent source of the blight's corruption in the environment.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "Following Kael's lead, they discover a once-pure spring now bubbling with dark, viscous ichor, its surrounding flora withered.",
          "type": "investigation",
          "outcome": "The group locates a significant, localized source of the Shadow Blight's corruption.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael"
          ],
          "threads": [
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "Confronting the Taint",
      "intent": "Eldrin attempts to cleanse the source, showcasing his growing but still limited power.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "Eldrin channels ancient energies, attempting to purify the corrupted spring, the effort draining him but achieving a partial, temporary cleansing.",
          "type": "action",
          "outcome": "Eldrin successfully, though partially, purifies the blighted spring, demonstrating a significant return of his magic.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael"
          ],
          "threads": [
            "THREAD_Rediscovering_Magic",
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "The Blight's Resilience",
      "intent": "Show that the blight is not easily defeated, even by Eldrin's magic.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "Despite Eldrin's efforts, a faint residue of corruption lingers, hinting at the blight's deep-rooted and resilient nature.",
          "type": "consequence",
          "outcome": "The blight proves resilient, suggesting that its source is deeper than a single spring and requires more than simple cleansing.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael"
          ],
          "threads": [
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 4,
      "title": "A Shared Burden",
      "intent": "The group solidifies their bond through shared peril and purpose.",
      "scenes": [
        {
          "scene_id": 4,
          "summary": "Exhausted but united, the trio acknowledges the formidable nature of their foe, their individual motivations aligning into a common purpose.",
          "type": "aftermath",
          "outcome": "The shared experience solidifies the group's bond and their commitment to fighting the blight.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael"
          ],
          "threads": [
            "THREAD_Gathering_Allies"
          ]
        }
      ]
    }
  ]
}