{
  "chapter_id": 8,
  "title": "A City's Hidden Scars",
  "goal": "Show the blight's impact on a larger community, introducing urban intrigue and the subtle ways corruption can manifest beyond the wilderness.",
  "chapter_role": "investigation",
  "stakes_shift": "The blight is revealed not just as wilderness corruption but a social disease, affecting trust, governance, and the very fabric of urban life.",
  "bridge": {
    "from_prev": "The group has confronted a physical manifestation of the blight.",
    "to_next": "The search for answers expands from direct observation to ancient texts and scholarly interpretation, requiring new allies."
  },
  "pacing": {
    "intensity": 3,
    "tempo": "steady",
    "expected_scene_count": 9
  },
  "sections": [
    {
      "section_id": 1,
      "title": "Gates of Sanctuary",
      "intent": "The group arrives at a frontier town, initially appearing normal, but with subtle hints of underlying tension.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "They arrive at the fortified gates of Oakhaven, a bustling frontier town, its surface calm belying an undercurrent of unease.",
          "type": "transition",
          "outcome": "The group safely reaches Oakhaven, a seemingly normal but subtly troubled frontier town.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "Whispers in the Market",
      "intent": "Show the social impact of the blight, through rumors and the behavior of the townsfolk.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "In the crowded market, they overhear hushed rumors of strange illnesses, dwindling harvests, and increasing paranoia among the townsfolk.",
          "type": "reveal",
          "outcome": "The group discovers the blight's social and economic impact on the town, manifesting as fear and scarcity.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael"
          ],
          "threads": [
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "Kael's Connections",
      "intent": "Use Kael's past to gain access to information or contacts within the town.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "Kael uses old contacts to gather information, revealing a growing discontent with the local lord and strange new decrees.",
          "type": "investigation",
          "outcome": "Kael's contacts reveal unsettling political tensions and strange new laws within Oakhaven.",
          "characters": [
            "CHAR_Kael",
            "CHAR_Eldrin",
            "CHAR_Lyra"
          ],
          "threads": [
            "THREAD_Valerius_Deception"
          ]
        }
      ]
    }
  ]
}