{
  "chapter_id": 23,
  "title": "The Greater Shadow",
  "goal": "Reveal that Valerius was merely a pawn, and the true, overarching antagonist and threat still remains, setting up future conflicts.",
  "chapter_role": "transition",
  "stakes_shift": "The immediate threat is gone, but a far greater, unknown danger looms, shifting the focus from a local problem to a world-spanning conflict.",
  "bridge": {
    "from_prev": "The city is recovering, but the blight's ultimate source is unknown.",
    "to_next": "A new quest is set, and Eldrin fully embraces his destiny as the Awakened Sage."
  },
  "pacing": {
    "intensity": 4,
    "tempo": "steady",
    "expected_scene_count": 9
  },
  "sections": [
    {
      "section_id": 1,
      "title": "A Pawn's Demise",
      "intent": "Confirm Valerius's subordinate role, hinting at a higher power.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "Through Valerius's remaining journals and Eldrin's insights, they realize he was merely a puppet, manipulated by a greater, unseen force.",
          "type": "reveal",
          "outcome": "The group discovers Valerius was a pawn, serving a larger, unseen antagonistic force.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Seraphina",
            "CHAR_Lyra",
            "CHAR_Kael"
          ],
          "threads": [
            "THREAD_Shadow_Blight",
            "THREAD_Valerius_Deception"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "Whispers from the Void",
      "intent": "Provide a first, unsettling glimpse or hint of the true, overarching antagonist.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "Eldrin senses a vast, ancient darkness stirring beyond the immediate blight, a chilling presence far more potent than Valerius.",
          "type": "escalation",
          "outcome": "Eldrin senses the true, immense power of the overarching Shadow Blight, far beyond Valerius's influence.",
          "characters": [
            "CHAR_Eldrin"
          ],
          "threads": [
            "THREAD_Shadow_Blight",
            "THREAD_Ancient_Prophecy"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "The Unseen Threat",
      "intent": "The group acknowledges the true scale of the threat and the need for a larger quest.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "The group understands that the battle against Valerius was but a skirmish, and a far greater, more ancient Shadow Blight looms over the world.",
          "type": "consequence",
          "outcome": "The group acknowledges the vast, global scale of the Shadow Blight and the need for a grander quest.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    }
  ]
}