{
  "chapter_id": 22,
  "title": "Healing the Wounds",
  "goal": "Deal with the immediate fallout of Valerius's defeat, beginning the process of healing the city and addressing the humanitarian crisis.",
  "chapter_role": "aftermath",
  "stakes_shift": "The heroes must now address the humanitarian and political consequences of their actions, working to heal a traumatized city and restore order.",
  "bridge": {
    "from_prev": "Valerius is defeated, but the city is in chaos and the blight lingers.",
    "to_next": "The heroes realize Valerius was merely a pawn, and a far greater, unknown danger looms."
  },
  "pacing": {
    "intensity": 3,
    "tempo": "steady",
    "expected_scene_count": 8
  },
  "sections": [
    {
      "section_id": 1,
      "title": "A City in Recovery",
      "intent": "Show the immediate efforts to restore order and aid the blighted citizens.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "The group emerges from the tunnels to a city in disarray, leading efforts to calm the populace and tend to those affected by the blight.",
          "type": "aftermath",
          "outcome": "The city begins a slow process of recovery, with the group aiding in humanitarian efforts.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "Seeds of Hope",
      "intent": "Eldrin uses his magic to begin cleansing the city, offering a symbol of hope.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "Eldrin channels his magic to slowly cleanse areas of the city, offering a tangible sign of hope and healing to the traumatized citizens.",
          "type": "action",
          "outcome": "Eldrin begins to cleanse parts of the city, offering a symbol of hope and healing.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra"
          ],
          "threads": [
            "THREAD_Rediscovering_Magic",
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "New Leadership",
      "intent": "Establish a new, temporary leadership for the city, with Kael playing a role.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "Kael, with his military background, helps establish a provisional council, ensuring stability and preventing further chaos.",
          "type": "setup",
          "outcome": "Kael helps establish a new, temporary leadership to stabilize the city.",
          "characters": [
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Gathering_Allies"
          ]
        }
      ]
    }
  ]
}