{
  "chapter_id": 15,
  "title": "Rekindling the Spark",
  "goal": "Eldrin undergoes a ritual or intense training to regain a significant portion of his lost magical power, preparing him for the confrontation.",
  "chapter_role": "trial",
  "stakes_shift": "Eldrin's increased power gives them a fighting chance against Valerius, but also draws more attention from the blight and its forces, making him a greater target.",
  "bridge": {
    "from_prev": "The group is in hiding, aware of Valerius's active pursuit.",
    "to_next": "The group initiates a public challenge to Valerius, forcing a direct confrontation and risking open conflict."
  },
  "pacing": {
    "intensity": 4,
    "tempo": "slow_burn",
    "expected_scene_count": 8
  },
  "sections": [
    {
      "section_id": 1,
      "title": "The Ancient Ritual",
      "intent": "Eldrin prepares for a dangerous ritual to reclaim his power, guided by ancient texts.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "Guided by Seraphina's research, Eldrin prepares for an arduous, ancient ritual to draw upon dormant ley lines and rekindle his full magical potential.",
          "type": "setup",
          "outcome": "Eldrin begins a perilous ancient ritual to restore his full magical power.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Rediscovering_Magic"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "A Test of Will",
      "intent": "Show the difficulty and danger of Eldrin's ritual, with his allies supporting him.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "Eldrin endures visions and immense magical strain during the ritual, his allies guarding the sanctuary and lending their emotional support.",
          "type": "action",
          "outcome": "Eldrin successfully completes the ritual, regaining a significant portion of his ancient power.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Rediscovering_Magic"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "Power Reborn",
      "intent": "Eldrin emerges with renewed power, ready for the coming conflict.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "Eldrin emerges from the ritual, visibly stronger, his eyes alight with ancient power, ready to face Valerius.",
          "type": "aftermath",
          "outcome": "Eldrin's powers are significantly restored, making him a formidable force.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Rediscovering_Magic"
          ]
        }
      ]
    }
  ]
}