{
  "chapter_id": 10,
  "title": "Scrolls of Doubt",
  "goal": "Uncover historical context for the blight and Eldrin's prophesied role, through Seraphina's research, deepening the mystery.",
  "chapter_role": "revelation",
  "stakes_shift": "The blight is revealed to be part of a larger, ancient cycle, and Eldrin's role is not merely reactive but prophesied, adding a layer of destiny to his burden.",
  "bridge": {
    "from_prev": "Seraphina has committed to researching the blight and Eldrin's past.",
    "to_next": "The revelations about the blight's history lead to unsettling discoveries about Lord Valerius's rising influence."
  },
  "pacing": {
    "intensity": 4,
    "tempo": "steady",
    "expected_scene_count": 10
  },
  "sections": [
    {
      "section_id": 1,
      "title": "Dust and Prophecy",
      "intent": "Seraphina begins her research, finding initial clues that hint at ancient warnings.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "Seraphina delves into forgotten texts, unearthing cryptic warnings of 'shadows that consume' and cycles of decay mirroring the blight.",
          "type": "investigation",
          "outcome": "Seraphina finds ancient texts describing a recurring darkness similar to the Shadow Blight.",
          "characters": [
            "CHAR_Seraphina",
            "CHAR_Eldrin"
          ],
          "threads": [
            "THREAD_Shadow_Blight",
            "THREAD_Ancient_Prophecy"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "The Awakened One",
      "intent": "Discover texts directly referencing an 'Awakened Sage' or a figure like Eldrin.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "Among the dusty scrolls, Seraphina discovers fragmented prophecies speaking of an 'Awakened One' destined to stand against the encroaching darkness.",
          "type": "reveal",
          "outcome": "Seraphina uncovers prophecies directly referencing Eldrin's role as the 'Awakened Sage'.",
          "characters": [
            "CHAR_Seraphina",
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael"
          ],
          "threads": [
            "THREAD_Ancient_Prophecy",
            "THREAD_Awakened_Sage"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "A Burden of Destiny",
      "intent": "Eldrin grapples with the weight of prophecy, while his allies react to this new information.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "Eldrin grapples with the weight of this ancient prophecy, his past actions now imbued with a larger, preordained significance.",
          "type": "consequence",
          "outcome": "Eldrin accepts the heavy burden of his prophesied role, cementing his commitment.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Awakened_Sage"
          ]
        }
      ]
    }
  ]
}