{
  "chapter_id": 18,
  "title": "Beneath the City's Roots",
  "goal": "Discover the true, hidden source of the blight within the city, revealing Valerius's deeper, more sinister plan.",
  "chapter_role": "investigation",
  "stakes_shift": "The blight's nexus is found beneath the city, indicating a deeper, more sinister plan than mere corruption, and revealing Valerius's ultimate goal.",
  "bridge": {
    "from_prev": "The group is hiding in the city's underbelly after escaping Valerius's forces.",
    "to_next": "The group interrupts Valerius's ritual, preventing a major blight escalation and leading to the final confrontation."
  },
  "pacing": {
    "intensity": 4,
    "tempo": "steady",
    "expected_scene_count": 9
  },
  "sections": [
    {
      "section_id": 1,
      "title": "The Root of Decay",
      "intent": "The group explores the tunnels, discovering signs of deeper corruption.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "As they navigate the ancient tunnels, the air grows heavy, and strange, blighted growths cling to the walls, leading them deeper.",
          "type": "investigation",
          "outcome": "The group discovers the tunnels are permeated with the Shadow Blight, leading them to its source.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "Valerius's Sanctum",
      "intent": "Discover Valerius's hidden ritual chamber, the true heart of his operations.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "They discover a vast, hidden chamber pulsing with dark energy, where Valerius conducts a grotesque ritual to amplify the blight.",
          "type": "reveal",
          "outcome": "The group discovers Valerius's secret sanctum, the true source of the blight within the city.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Valerius_Deception",
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "The Blighted Heart",
      "intent": "The group realizes the full scope of Valerius's plan and the immediate danger.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "The ritual is nearing completion, threatening to unleash a catastrophic wave of blight across the entire region, revealing Valerius's ultimate goal.",
          "type": "escalation",
          "outcome": "The group realizes Valerius's ritual is on the verge of unleashing a devastating blight upon the city and surrounding lands.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Shadow_Blight",
            "THREAD_Valerius_Deception"
          ]
        }
      ]
    }
  ]
}