{
  "chapter_id": 13,
  "title": "A Plea for Arms",
  "goal": "Solidify the alliance, particularly Kael's commitment, and prepare for direct action against Valerius, despite the overwhelming odds.",
  "chapter_role": "alliance",
  "stakes_shift": "The group commits to a dangerous, possibly suicidal, course of action against a powerful, entrenched lord, risking their lives and the stability of the region.",
  "bridge": {
    "from_prev": "The group has identified Valerius as their enemy and understands his treachery.",
    "to_next": "Valerius's agents make their presence known, actively hunting the group and increasing the immediate danger."
  },
  "pacing": {
    "intensity": 4,
    "tempo": "rush",
    "expected_scene_count": 9
  },
  "sections": [
    {
      "section_id": 1,
      "title": "The Hard Choice",
      "intent": "Kael grapples with fully committing to the cause, weighing personal risk against moral obligation.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "Kael, facing the reality of confronting a powerful lord, struggles with the choice between self-preservation and fighting for a greater cause.",
          "type": "choice",
          "outcome": "Kael fully commits to the group's cause, accepting the immense personal risk.",
          "characters": [
            "CHAR_Kael",
            "CHAR_Lyra",
            "CHAR_Eldrin"
          ],
          "threads": [
            "THREAD_Gathering_Allies"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "United Front",
      "intent": "The entire group solidifies their resolve and begins to plan their next move.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "With Kael's commitment, the group forms a united front, discussing strategies to expose Valerius and counter his influence.",
          "type": "setup",
          "outcome": "The core group solidifies their alliance and begins to strategize against Valerius.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Gathering_Allies"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "The Plan Unfolds",
      "intent": "Outline the initial, dangerous steps of their plan to expose or confront Valerius.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "Their plan involves gathering public support and finding a way to present the evidence against Valerius in a manner he cannot easily dismiss.",
          "type": "setup",
          "outcome": "The group devises a perilous plan to expose Valerius and rally support against him.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Valerius_Deception"
          ]
        }
      ]
    }
  ]
}