{
  "chapter_id": 24,
  "title": "A Vow to the Future",
  "goal": "Establish the new mission, Eldrin fully accepts his role as the Awakened Sage, and the group commits to confronting the ultimate source of the Shadow Blight.",
  "chapter_role": "hinge",
  "stakes_shift": "The group commits to a new, more dangerous journey to confront the ultimate source of the Shadow Blight, accepting their roles as the world's last hope.",
  "bridge": {
    "from_prev": "The group understands the true, vast scale of the Shadow Blight.",
    "to_next": "The journey to confront the ultimate source of the Shadow Blight begins."
  },
  "pacing": {
    "intensity": 4,
    "tempo": "steady",
    "expected_scene_count": 8
  },
  "sections": [
    {
      "section_id": 1,
      "title": "The Path Ahead",
      "intent": "The group discusses their next steps and the daunting nature of their new quest.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "The allies gather, discussing ancient maps and fragmented lore, seeking clues to the ultimate source of the Shadow Blight.",
          "type": "setup",
          "outcome": "The group begins to plan their journey to confront the true source of the Shadow Blight.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Shadow_Blight",
            "THREAD_Gathering_Allies"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "The Awakened's Oath",
      "intent": "Eldrin fully embraces his role and destiny as the Awakened Sage.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "Eldrin, no longer burdened by doubt, fully embraces his destiny as the Awakened Sage, vowing to cleanse the world of the Shadow Blight.",
          "type": "choice",
          "outcome": "Eldrin fully accepts his role as the Awakened Sage, committing to his destiny.",
          "characters": [
            "CHAR_Eldrin"
          ],
          "threads": [
            "THREAD_Awakened_Sage",
            "THREAD_Ancient_Prophecy"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "Journey to the Unknown",
      "intent": "The group sets out on their new, epic quest, leaving the city behind.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "With a shared purpose, Eldrin and his allies depart the recovering city, their gaze fixed on the distant, unknown lands where the true darkness lies.",
          "type": "transition",
          "outcome": "The group embarks on a new, epic journey to confront the ultimate source of the Shadow Blight.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Gathering_Allies",
            "THREAD_Shadow_Blight",
            "THREAD_Awakened_Sage"
          ]
        }
      ]
    }
  ]
}