{
  "chapter_id": 6,
  "title": "Whispers of the Forgotten",
  "goal": "Blend Kael's local knowledge of strange occurrences with Eldrin's ancient lore, giving the blight a more concrete, current context.",
  "chapter_role": "revelation",
  "stakes_shift": "Kael's grounded knowledge provides practical insights into the blight's immediate effects, while Eldrin's ancient wisdom offers a deeper, unsettling historical context.",
  "bridge": {
    "from_prev": "Eldrin, Lyra, and Kael have formed a fragile alliance.",
    "to_next": "The group investigates a direct source of corruption, pushing Eldrin to further test his reawakening powers."
  },
  "pacing": {
    "intensity": 3,
    "tempo": "steady",
    "expected_scene_count": 8
  },
  "sections": [
    {
      "section_id": 1,
      "title": "Shared Histories",
      "intent": "Kael shares stories of recent, unsettling events in the region, connecting them to the blight.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "Around a flickering campfire, Kael recounts tales of strange animal behavior, vanishing villagers, and unnaturally fertile or barren lands.",
          "type": "reveal",
          "outcome": "Kael's stories provide concrete examples of the blight's current impact on the region.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael"
          ],
          "threads": [
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "Echoes of Prophecy",
      "intent": "Eldrin connects Kael's stories to ancient prophecies or warnings, adding weight to the threat.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "Eldrin, listening to Kael, finds unsettling parallels with ancient prophecies and warnings of a encroaching darkness, sharing fragments of lore.",
          "type": "escalation",
          "outcome": "Eldrin links Kael's observations to ancient prophecies, hinting at a larger, preordained conflict.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael"
          ],
          "threads": [
            "THREAD_Ancient_Prophecy",
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "A New Purpose",
      "intent": "Kael begins to see a purpose beyond mere survival, swayed by the scope of the threat.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "The sheer scale of the threat, revealed through Eldrin's words, begins to stir a forgotten sense of duty within Kael.",
          "type": "choice",
          "outcome": "Kael's mercenary resolve wavers, replaced by a nascent sense of responsibility towards the growing darkness.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael"
          ],
          "threads": [
            "THREAD_Gathering_Allies"
          ]
        }
      ]
    }
  ]
}