{
  "chapter_id": 14,
  "title": "The Unseen Hand",
  "goal": "Show Valerius's active opposition and increasing vigilance, raising the immediate danger and forcing the group to act cautiously.",
  "chapter_role": "pressure",
  "stakes_shift": "Valerius's agents are actively hunting them, making their presence in the city precarious and escalating the conflict into a direct cat-and-mouse game.",
  "bridge": {
    "from_prev": "The group has formed an alliance and begun to plan their action against Valerius.",
    "to_next": "Eldrin undergoes a ritual to regain more of his power, preparing for the inevitable confrontation."
  },
  "pacing": {
    "intensity": 5,
    "tempo": "steady",
    "expected_scene_count": 8
  },
  "sections": [
    {
      "section_id": 1,
      "title": "Eyes in the Shadows",
      "intent": "Show Valerius's agents actively searching for the group, creating tension.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "The group notices increased patrols and suspicious figures in the city, realizing Valerius's network is actively searching for them.",
          "type": "escalation",
          "outcome": "The group realizes Valerius's agents are actively hunting them, increasing their peril.",
          "characters": [
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Eldrin"
          ],
          "threads": [
            "THREAD_Valerius_Deception"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "Narrow Escape",
      "intent": "A direct, tense encounter with Valerius's agents, showcasing the group's resourcefulness.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "A close call in the city's labyrinthine alleys forces the group to use their combined skills for a desperate escape.",
          "type": "action",
          "outcome": "The group narrowly escapes an ambush by Valerius's agents, confirming their enemy's awareness.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Valerius_Deception"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "A Hidden Sanctuary",
      "intent": "The group finds a temporary, secure hiding place to regroup and plan.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "Seraphina leads them to a forgotten, hidden chamber beneath her archive, offering a temporary sanctuary from Valerius's reach.",
          "type": "setup",
          "outcome": "The group finds a secret, temporary sanctuary to evade Valerius's pursuit.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Valerius_Deception"
          ]
        }
      ]
    }
  ]
}