{
  "chapter_id": 16,
  "title": "The Mask Slips",
  "goal": "Publicly challenge Valerius, forcing a direct confrontation and exposing his corruption to the populace.",
  "chapter_role": "confrontation",
  "stakes_shift": "The conflict moves from the shadows into the open, with public opinion, civic order, and the city's immediate future hanging in the balance.",
  "bridge": {
    "from_prev": "Eldrin has regained significant power, and the group is ready to act.",
    "to_next": "Valerius retaliates immediately and forcefully, forcing the group into a desperate flight for survival."
  },
  "pacing": {
    "intensity": 5,
    "tempo": "rush",
    "expected_scene_count": 10
  },
  "sections": [
    {
      "section_id": 1,
      "title": "A Public Accusation",
      "intent": "The group makes their move, publicly accusing Valerius.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "Eldrin, empowered, confronts Valerius during a public address, exposing his blighted deeds and presenting the evidence gathered by Seraphina.",
          "type": "action",
          "outcome": "Eldrin publicly accuses Valerius, presenting irrefutable evidence of his corruption to the populace.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina",
            "CHAR_Valerius"
          ],
          "threads": [
            "THREAD_Valerius_Deception"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "Chaos in the Square",
      "intent": "Valerius attempts to suppress the truth, leading to public unrest and immediate danger.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "Valerius, enraged, unleashes his corrupted guards and attempts to discredit Eldrin, plunging the city square into chaos.",
          "type": "escalation",
          "outcome": "Valerius's attempt to silence Eldrin sparks public unrest and a violent confrontation.",
          "characters": [
            "CHAR_Valerius",
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Valerius_Deception"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "The Blight Revealed",
      "intent": "Show Valerius's true nature and his connection to the blight in the ensuing chaos.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "As Valerius's forces attack, some guards reveal blighted features, confirming his corruption to the horrified populace.",
          "type": "reveal",
          "outcome": "Valerius's corrupted forces are exposed, revealing his direct connection to the Shadow Blight.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina",
            "CHAR_Valerius"
          ],
          "threads": [
            "THREAD_Shadow_Blight",
            "THREAD_Valerius_Deception"
          ]
        }
      ]
    }
  ]
}