{
  "chapter_id": 19,
  "title": "The Ritual of Decay",
  "goal": "The group interrupts Valerius's ritual, preventing a major blight escalation and leading directly into the final confrontation.",
  "chapter_role": "climax",
  "stakes_shift": "The fate of the city, possibly the entire region, hangs on their success in stopping the ritual, with failure meaning widespread devastation.",
  "bridge": {
    "from_prev": "The group has discovered Valerius's ritual chamber and the imminent threat.",
    "to_next": "Eldrin confronts Valerius directly in a climactic magical and physical battle."
  },
  "pacing": {
    "intensity": 5,
    "tempo": "rush",
    "expected_scene_count": 10
  },
  "sections": [
    {
      "section_id": 1,
      "title": "Intervention",
      "intent": "The group launches their attack to disrupt the ritual, facing Valerius's remaining forces.",
      "scenes": [
        {
          "scene_id": 1,
          "summary": "The group bursts into the chamber, launching a desperate assault to disrupt the ritual, clashing with Valerius's loyal, blighted guards.",
          "type": "action",
          "outcome": "The group successfully interrupts Valerius's ritual, preventing its catastrophic completion.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina",
            "CHAR_Valerius"
          ],
          "threads": [
            "THREAD_Valerius_Deception",
            "THREAD_Shadow_Blight"
          ]
        }
      ]
    },
    {
      "section_id": 2,
      "title": "Valerius's Fury",
      "intent": "Valerius reacts with extreme anger and reveals his own blighted powers.",
      "scenes": [
        {
          "scene_id": 2,
          "summary": "Valerius, enraged by their interference, sheds his human guise, revealing his own corruption and wielding dark, blighted magic.",
          "type": "escalation",
          "outcome": "Valerius reveals his own corrupted form and wields dark magic, personally joining the fight.",
          "characters": [
            "CHAR_Valerius",
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina"
          ],
          "threads": [
            "THREAD_Shadow_Blight",
            "THREAD_Valerius_Deception"
          ]
        }
      ]
    },
    {
      "section_id": 3,
      "title": "A Desperate Stand",
      "intent": "The group fights a pitched battle against Valerius and his remaining corrupted forces.",
      "scenes": [
        {
          "scene_id": 3,
          "summary": "A fierce battle ensues, Eldrin's renewed magic clashing with Valerius's blight-fueled power, while Lyra and Kael protect Seraphina.",
          "type": "action",
          "outcome": "The group engages in a desperate, pitched battle against Valerius and his corrupted forces.",
          "characters": [
            "CHAR_Eldrin",
            "CHAR_Lyra",
            "CHAR_Kael",
            "CHAR_Seraphina",
            "CHAR_Valerius"
          ],
          "threads": [
            "THREAD_Gathering_Allies",
            "THREAD_Rediscovering_Magic"
          ]
        }
      ]
    }
  ]
}