{
  "chapter": 1,
  "key_events": [
    "Kaelen attempted to reinforce a failing iron ward-ring, resulting in a painful magical backlash.",
    "The Star-glass of the West Gate was found to be 'feverish' and heavily fractured.",
    "Kaelen's tuning fork was destroyed by the intense discordant energy of the Spire.",
    "Kaelen realized the isolation of his post has become a deadly liability as the wards began to catastrophically fail.",
    "Kaelen climbed to the upper gallery after finding the archives sealed by void-frost.",
    "A star fell from the Spear-Bearer constellation, turning from white to a sickly violet.",
    "The star impacted the Silver Valley, creating a crown of solidified glass and a rhythmic, alien heartbeat.",
    "The shockwave caused the High Spire to tilt and shattered the star-glass pillars.",
    "The Starwrought Oath in Kaelen's marrow buckled and fractured, losing its light.",
    "Kaelen observed a shadow-shape emerging from the impact site before fleeing.",
    "Kaelen descended into the Silver Valley, now a sea of flash-melted glass.",
    "The physical pewter filament of the Starwrought Oath ground into Kaelen's radius bone.",
    "Kaelen reached the central crater and found the star-shard beating like a heart.",
    "Proximity to the shard caused the fractured Oath to flare with necrotic purple light.",
    "Kaelen touched the shard, experiencing visions of a dying galaxy and a cosmic beast.",
    "Kaelen secured the shard in his satchel as shadow-forms began to hunt him.",
    "Shadow-forms emerged from the impact glass, drawn to the star-shard's resonance.",
    "Kaelen experienced the grinding agony of the physical pewter filament in his radius bone during magic use.",
    "Kaelen suffered significant frost-burn and waxy skin discoloration on his right arm.",
    "A massive discharge of violet energy destroyed the pursuing shadow-forms and the ledge they occupied.",
    "Kaelen reached the safety of the crater rim, though his arm is currently non-functional.",
    "Kaelen collapses on the crater rim, suffering from previous frost-burn and scorched lungs.",
    "The star-shard's 'thump-hiss' resonance intensifies, forcing Kaelen to attempt a stabilization rite.",
    "Upon touching the shard, Kaelen sees a vision of a cosmic beast and a dying galaxy.",
    "Kaelen bridges the gap between the shard and the physical pewter filament in his radius bone.",
    "The shard's pulse and Kaelen's heartbeat synchronize, stabilizing his physical condition at the cost of permanent corruption.",
    "Kaelen observes the tilting High Spire and begins his ascent, now carrying the 'Star-Heart'.",
    "Kaelen felt the pewter filament of his Oath grinding in his radius bone as he navigated the tilting Spire.",
    "The physical star-shard in Kaelen's satchel synchronized its 'thump-hiss' pulse with his heartbeat.",
    "Kaelen observed the 'Star-Bleed' violet fluid dissolving the Spire's architecture.",
    "Commander Varkas was found corrupted, his eyes turned to violet voids and his heart replaced by star-glass.",
    "Varkas declared the Oath a lie and the stars as a waiting threat rather than a watched one.",
    "A resonance clash occurred between Kaelen's shard and Varkas's corruption, shattering the room's glass.",
    "The High Spire began its final collapse as Varkas confronted Kaelen.",
    "Kaelen uses the star-shard's resonance to bypass Varkas's void-defenses.",
    "Varkas is killed, dissolving into ash and crystalline shards.",
    "Kaelen suffers severe starwrought scarring on his right arm from the magical discharge.",
    "The Star-Maps are secured in Kaelen's satchel.",
    "Kaelen begins a desperate escape toward the battlements as the Spire falls.",
    "Kaelen felt the physical pewter filament of his Oath grinding in his radius bone during the escape.",
    "The High Spire underwent a total structural and magical failure, dissolving into violet mist.",
    "Kaelen secured the Star-Maps and the physical star-shard before the Spire's destruction.",
    "Kaelen used shard-resonance to disintegrate a jammed door on the battlements.",
    "Kaelen witnessed the final unmaking of the High Spire from the valley floor.",
    "Kaelen accepted his new role as a fugitive and began his journey away from the ruins."
  ],
  "must_stay_true": [
    "Kaelen's magic is tied to a physical 'Starwrought Oath' that manifests as a thread in his wrist.",
    "Magic use has a clear physical cost, including coldness, scorched lungs, and metallic scents.",
    "The High Spire is isolated and the wards are failing at an accelerated, unnatural rate.",
    "The stars are appearing 'heavy' and unstable in the sky.",
    "The Starwrought Oath is a physical pewter-colored thread woven into the marrow of the radius bone.",
    "Magic use causes physical frost-burn and scorched lungs.",
    "The starfall corruption is characterized by a bruised violet light and a rhythmic thrumming.",
    "The High Spire is in a state of catastrophic collapse.",
    "The Starwrought Oath is a physical pewter-colored filament woven into the marrow of the radius bone.",
    "Magic and star-matter proximity cause physical frost-burn, scorched lungs, and metallic scents.",
    "The starfall corruption is characterized by a rhythmic 'thump-hiss' and violet light.",
    "The High Spire is in a state of catastrophic collapse and tilting.",
    "The shard is now tied to Kaelen's life force and Oath-essence.",
    "Magic use causes physical frost-burn, scorched lungs, and metallic scents.",
    "The star-shard is a physical object currently held in Kaelen's satchel.",
    "The shadow-forms are attracted to the shard's 'thump-hiss' resonance.",
    "Kaelen's right arm is severely injured from the Oath's fracture and subsequent discharge.",
    "The Starwrought Oath is a physical pewter filament woven into the radius bone.",
    "The star-shard is now physically and magically bound to Kaelen's life force.",
    "The cosmic beast is a real and present threat established through the shard's vision.",
    "Kaelen's right arm bears black, starwrought scarring from the integration.",
    "The star-shard is a physical object carried in Kaelen's satchel.",
    "Kaelen's right arm bears black, starwrought scarring following the path of the Oath-filament.",
    "The starfall corruption manifests as violet light, 'Star-Bleed' fluid, and a 'thump-hiss' resonance.",
    "The High Spire is tilting and undergoing catastrophic structural failure.",
    "The star-shard is a physical object carried in a satchel.",
    "The starfall corruption manifests as violet light and a 'thump-hiss' resonance.",
    "Starfall corruption is characterized by a rhythmic 'thump-hiss' resonance and violet light.",
    "Kaelen's right arm bears extensive black starwrought scarring.",
    "The High Spire is completely destroyed and no longer exists as a physical structure.",
    "Kaelen is the sole survivor of the High Spire's final moments."
  ]
}