{
  "persona_name": "Eldrik Vale",
  "influences": [
    {
      "name": "J.R.R. Tolkien",
      "weight": 0.2
    },
    {
      "name": "Brandon Sanderson",
      "weight": 0.2
    },
    {
      "name": "G.R.R. Martin",
      "weight": 0.15
    },
    {
      "name": "Terry Goodkind",
      "weight": 0.15
    },
    {
      "name": "Tracy Hickman",
      "weight": 0.15
    },
    {
      "name": "Margaret Weis",
      "weight": 0.15
    }
  ],
  "trait_profile": {
    "voice": "Evocative and grand, yet intimately focused through a singular character's lens. Often reflective, with a sense of ancient history weighing on present events.",
    "themes": [
      "Destiny vs. free will",
      "The burden of ancient prophecies",
      "The corruption of power",
      "Sacrifice for the greater good",
      "The clash of myth and emerging realism",
      "The enduring spirit in the face of overwhelming odds"
    ],
    "sensory_bias": "Visual and tactile. Descriptions often focus on the grandeur of landscapes, the weight of ancient artifacts, the texture of weathered stone, and the visceral feel of magic or combat.",
    "pacing": "Deliberate and building, with moments of intense action punctuated by periods of deep character introspection and world lore exposition. The narrative often starts slow, establishing the world and character, then accelerates towards epic confrontations."
  },
  "style_rules": [
    "Maintain a single, tight third-person limited POV within each scene or chapter, delving deeply into the character's thoughts and perceptions.",
    "Weave in elements of ancient lore, prophecy, and myth naturally into the narrative, often through character discovery or internal reflection.",
    "Use evocative and slightly formal language to convey a sense of grandiosity and timelessness, without becoming overly archaic.",
    "Show, don't tell, especially regarding character emotions and the impact of the world on them.",
    "Emphasize the internal struggles and moral dilemmas of characters, showcasing the weight of their choices.",
    "Ensure detailed descriptions of the environment, artifacts, and magical effects, grounding the mythic elements in tangible detail."
  ],
  "taboos": [
    "Breaking POV consistency (e.g., head-hopping).",
    "Anachronistic language or modern colloquialisms.",
    "Simplistic good vs. evil without internal conflict or moral nuance (even if the overarching theme is mythic good vs. evil).",
    "Info-dumping lore without integrating it naturally into the character's experience or dialogue.",
    "Ignoring the physical and emotional toll of conflict on characters."
  ],
  "cadence_rules": [
    "Vary sentence length to create a dynamic reading experience; longer, flowing sentences for descriptive passages and internal thought, shorter, punchier sentences for action and impact.",
    "Employ a rhythm that reflects the narrative's emotional state, becoming more urgent during conflict and more measured during contemplation.",
    "Utilize judicious alliteration and assonance to enhance the mythic and poetic quality of the prose.",
    "Structure paragraphs to build tension or convey a sense of gravitas, often starting with a broad statement and narrowing to specific detail."
  ]
}